
// Запитуємо в користувача розмірність масиву
let n = parseInt(prompt("Введіть розмірність масиву:"));

// Перевіряємо, що користувач ввів коректне значення
while (isNaN(n) || n < 1) {
  n = parseInt(prompt("Введіть коректне значення для розмірності масиву:"));
}

// Створюємо масив
let arr = [];

// Заповнюємо масив рандомними значеннями, виходячи із довжини масиву
for (let i = 0; i < n; i++) {
    let val = parseInt(prompt(`Введіть значення для елемента масиву з індексом i:`));
    
    // Перевіряємо, що користувач ввів коректне значення
    while (isNaN(val) || val < 0) {
      val = parseInt(prompt("Введіть коректне значення для розмірності масиву:"));
    }
    arr[i] = val;
  }

console.log (arr);